// js/items.js
// 持ち物データ（曜日 × 時間）

const items = {
  mon: {
    1: ["教科書", "ノート"],
    2: ["教科書", "ノート"],
    3: ["PC"],
    4: ["教科書", "ノート"],
    5: ["エプロン"],
    6: ["エプロン"],
    7: ["教科書", "ノート"]
  },
  tue: {
    1: ["教科書"],
    2: ["体育館シューズ"],
    3: ["PC"],
    4: ["PC"],
    5: [],
    6: []
  },
  wed: {
    1: ["教科書", "ノート"],
    2: ["教科書", "プリント"],
    3: ["音楽教科書"],
    4: ["音楽教科書"],
    5: ["教科書", "ノート"],
    6: ["体育館シューズ"]
  },
  thu: {
    1: ["教科書", "ノート"],
    2: ["実習道具"],
    3: ["PC"],
    4: ["ファイル", "工具", "※実習服に更衣"],
    5: ["ファイル", "工具", "※実習服に更衣"],
    6: ["ファイル", "工具", "※実習服に更衣"]
  },
  fri: {
    1: ["教科書", "ノート"],
    2: ["教科書",],
    3: ["教科書", "プリント"],
    4: ["教科書",],
    5: ["教科書"],
    6: ["教科書"]
  }
};
