
// js/rooms.js
// 教室データ（曜日 × 時間）

const rooms = {
  mon: {
    1: "図書室",
    2: "教室or221教室",
    3: "教室",
    4: "教室",
    5: "教室(家庭科室)",
    6: "教室(家庭科室)",
    7: "教室"
  },
  tue: {
    1: "教室",
    2: "運動場or体育館",
    3: "せん孔室",
    4: "せん孔室",
    5: "教室",
    6: "教室"
  },
  wed: {
    1: "教室",
    2: "教室",
    3: "視聴覚室or美術室",
    4: "視聴覚室or美術室",
    5: "教室or221教室",
    6: "運動場or体育館"
  },
  thu: {
    1: "教室or221教室",
    2: "教室",
    3: "教室",
    4: "総合実習室",
    5: "総合実習室",
    6: "総合実習室"
  },
  fri: {
    1: "教室",
    2: "教室",
    3: "教室",
    4: "教室",
    5: "教室",
    6: "教室"
  }
};

